In [1]:
import pandas as pd
df = pd.read_csv('vgsales.csv')
df.shape

(16324, 11)

In [2]:
df.describe()

,Rank,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
count,16324.000000,16324.000000,16324.000000,16324.000000,16324.000000,16324.000000,16324.000000
mean,8291.508270,2006.404251,0.265464,0.147581,0.078673,0.048334,0.540328
std,4792.043734,5.826744,0.821658,0.508809,0.311584,0.189902,1.565860
min,1.000000,1980.000000,0.000000,0.000000,0.000000,0.000000,0.010000
25%,4135.750000,2003.000000,0.000000,0.000000,0.000000,0.000000,0.060000
50%,8293.500000,2007.000000,0.080000,0.020000,0.000000,0.010000,0.170000
75%,12439.250000,2010.000000,0.240000,0.110000,0.040000,0.040000,0.480000
max,16600.000000,2016.000000,41.490000,29.020000,10.220000,10.570000,82.740000

In [3]:
df.values

array([[259, 'Asteroids', '2600', ..., 0.0, 0.05, 4.31],
       [545, 'Missile Command', '2600', ..., 0.0, 0.03, 2.76],
       [1768, 'Kaboom!', '2600', ..., 0.0, 0.01, 1.15],
       ...,
       [16573, 'Farming 2017 - The Simulation', 'PS4', ..., 0.0, 0.0,
        0.01],
       [16579, 'Rugby Challenge 3', 'XOne', ..., 0.0, 0.0, 0.01],
       [16592, 'Chou Ezaru wa Akai Hana: Koi wa Tsuki ni Shirube Kareru',
        'PSV', ..., 0.01, 0.0, 0.01]], shape=(16324, 11), dtype=object)

In [4]:
import pandas as pd
data = pd.read_csv('music.csv')
data.drop(columns=['age'])

   gender    genra
0       1   HipHop
1       1   HipHop
2       1   HipHop
3       1     Jazz
4       1     Jazz
5       1     Jazz
6       1  Classic
7       1  Classic
8       1  Classic
9       0    Dance